In [3]:
import pandas as pd  #before writing this code I created a sheet in ms excel with csv extension
pd.read_csv('salary.csv')

     name  salaries
0     crs         2
1    raks         3
2   sachs         4
3    navs         5
4   ships         6
5    hars         7
6     bas         6
7     har         5
8    ajbs         4
9    jabs         3
10  shivs         3

In [4]:
import pandas as pd  
pd.read_csv('salary.csv',squeeze=True) #we converted into sereis which means we can extract name and salaries separatly

     name  salaries
0     crs         2
1    raks         3
2   sachs         4
3    navs         5
4   ships         6
5    hars         7
6     bas         6
7     har         5
8    ajbs         4
9    jabs         3
10  shivs         3

In [6]:
import pandas as pd  
pd.read_csv('salary.csv',squeeze=True,usecols=['name'])

0       crs
1      raks
2     sachs
3      navs
4     ships
5      hars
6       bas
7       har
8      ajbs
9      jabs
10    shivs
Name: name, dtype: object

In [7]:
import pandas as pd  
name=pd.read_csv('salary.csv',squeeze=True) 
name.head()

    name  salaries
0    crs         2
1   raks         3
2  sachs         4
3   navs         5
4  ships         6

In [8]:
name.head(8)

    name  salaries
0    crs         2
1   raks         3
2  sachs         4
3   navs         5
4  ships         6
5   hars         7
6    bas         6
7    har         5

In [9]:
name.tail()

     name  salaries
6     bas         6
7     har         5
8    ajbs         4
9    jabs         3
10  shivs         3

In [10]:
name.tail(8)

     name  salaries
3    navs         5
4   ships         6
5    hars         7
6     bas         6
7     har         5
8    ajbs         4
9    jabs         3
10  shivs         3

In [11]:
name.values

array([['crs', 2],
       ['raks', 3],
       ['sachs', 4],
       ['navs', 5],
       ['ships', 6],
       ['hars', 7],
       ['bas', 6],
       ['har', 5],
       ['ajbs', 4],
       ['jabs', 3],
       ['shivs', 3]], dtype=object)

In [12]:
name.index

RangeIndex(start=0, stop=11, step=1)

In [15]:
name.dtypes

name        object
salaries     int64
dtype: object

In [18]:
name.is_unique

AttributeError: 'DataFrame' object has no attribute 'is_unique'

In [19]:
name.ndim

2

In [20]:
name.size

22

In [21]:
name.name      #2nd name is actual name which we wrote in csv file

0       crs
1      raks
2     sachs
3      navs
4     ships
5      hars
6       bas
7       har
8      ajbs
9      jabs
10    shivs
Name: name, dtype: object

In [25]:
import pandas as pd
name = pd.read_csv('salary.csv',usecols=['name'],squeeze=True)
name

0       crs
1      raks
2     sachs
3      navs
4     ships
5      hars
6       bas
7       har
8      ajbs
9      jabs
10    shivs
Name: name, dtype: object

In [27]:
name.sort_values()      #observe output names are arrenged in alphabetical order

8      ajbs
6       bas
0       crs
7       har
5      hars
9      jabs
3      navs
1      raks
2     sachs
4     ships
10    shivs
Name: name, dtype: object

In [29]:
name.sort_values().head()

8    ajbs
6     bas
0     crs
7     har
5    hars
Name: name, dtype: object

In [31]:
name.sort_values(ascending=True)

8      ajbs
6       bas
0       crs
7       har
5      hars
9      jabs
3      navs
1      raks
2     sachs
4     ships
10    shivs
Name: name, dtype: object

In [33]:
name.sort_values(ascending=False)

10    shivs
4     ships
2     sachs
1      raks
3      navs
9      jabs
5      hars
7       har
0       crs
6       bas
8      ajbs
Name: name, dtype: object

In [34]:
name.sort_values(ascending=False).head()

10    shivs
4     ships
2     sachs
1      raks
3      navs
Name: name, dtype: object

In [39]:
import pandas as pd
google=pd.read_csv('google_stock.csv',squeeze=True)
google

0    50.560
1    49.870
2    50.980
3    49.230
4    50.670
5    50.760
6    49.540
7    49.450
8    50.234
Name: 49.52, dtype: float64

In [40]:
google.sort_values()

3    49.230
7    49.450
6    49.540
1    49.870
8    50.234
0    50.560
4    50.670
5    50.760
2    50.980
Name: 49.52, dtype: float64

In [41]:
google.head()

0    50.56
1    49.87
2    50.98
3    49.23
4    50.67
Name: 49.52, dtype: float64

In [42]:
x=google.sort_values()
x.head()

3    49.230
7    49.450
6    49.540
1    49.870
8    50.234
Name: 49.52, dtype: float64

In [1]:
import pandas as pd
name=pd.read_csv('salary.csv',usecols=['name'],squeeze=True)
name.head(4)

0      crs
1     raks
2    sachs
3     navs
Name: name, dtype: object

In [9]:
name.sort_values(ascending=False)

10    shivs
4     ships
2     sachs
1      raks
3      navs
9      jabs
5      hars
7       har
0       crs
6       bas
8      ajbs
Name: name, dtype: object

In [6]:
name.sort_values(ascending=False)    
name.head()   #observe it is not showing as ajbs,bas,crs,har,hars rather it is showing from origenal list

0      crs
1     raks
2    sachs
3     navs
4    ships
Name: name, dtype: object

In [8]:
name.sort_values(ascending=False,inplace=True)  # inplace replaces original list with modified one
name.head()                                #comapair output 6 with output 8

10    shivs
4     ships
2     sachs
1      raks
3      navs
Name: name, dtype: object

In [10]:
#now data is unstructered because of inplace function so now we have to rearrenge index vise
name.sort_index()   #data rearrenged see o/p

0       crs
1      raks
2     sachs
3      navs
4     ships
5      hars
6       bas
7       har
8      ajbs
9      jabs
10    shivs
Name: name, dtype: object

In [11]:
#now data is unstructered because of inplace function so now we have to rearrenge index vise
name.sort_index(ascending=False,inplace=True)   #data rearrenged see o/p 
name.head()             #observe index not data 10,9,8,7,6

10    shivs
9      jabs
8      ajbs
7       har
6       bas
Name: name, dtype: object

In [13]:
import pandas as pd 
name=pd.read_csv('salary.csv',usecols=['name'],squeeze=True)
name.head()

0      crs
1     raks
2    sachs
3     navs
4    ships
Name: name, dtype: object

In [14]:
name[6]

'bas'

In [16]:
name[[2,5,6]]

2    sachs
5     hars
6      bas
Name: name, dtype: object

In [17]:
name[2:7]   #7th value will not come so we have to take n+1 values

2    sachs
3     navs
4    ships
5     hars
6      bas
Name: name, dtype: object

In [18]:
name[:7]

0      crs
1     raks
2    sachs
3     navs
4    ships
5     hars
6      bas
Name: name, dtype: object

In [19]:
name[-7:]

4     ships
5      hars
6       bas
7       har
8      ajbs
9      jabs
10    shivs
Name: name, dtype: object

In [20]:
name[:-7]

0      crs
1     raks
2    sachs
3     navs
Name: name, dtype: object

In [21]:
import pandas as pd
name=pd.read_csv('salary.csv')
name

     name  salaries
0     crs         2
1    raks         3
2   sachs         4
3    navs         5
4   ships         6
5    hars         7
6     bas         6
7     har         5
8    ajbs         4
9    jabs         3
10  shivs         3

In [25]:
import pandas as pd
name=pd.read_csv('salary.csv',index_col='name',squeeze=True)  #2,3,4,5,6,7,.....this all are salaries not index values
name

name
crs      2
raks     3
sachs    4
navs     5
ships    6
hars     7
bas      6
har      5
ajbs     4
jabs     3
shivs    3
Name: salaries, dtype: int64

In [26]:
name[2]

4

In [28]:
name['hars']

7

In [30]:
name['har']

5

In [32]:
name[['raks','hars']]

name
raks    3
hars    7
Name: salaries, dtype: int64

In [73]:
import pandas as pd
name=pd.read_csv('salary.csv',index_col='name',squeeze=True)  
name.sort_index(inplace=True)
name.head()

name
ajbs    4
bas     6
crs     2
har     5
hars    7
Name: salaries, dtype: int64

In [76]:
name.get('hars')

7

In [82]:
name.get(['raks','hars'])

name
raks    3
hars    7
Name: salaries, dtype: int64

In [79]:
name.get(key=['raks','hars'])

name
raks    3
hars    7
Name: salaries, dtype: int64

In [95]:
name.get(key=['rak'],default='not found')

'not found'

In [100]:
import pandas as pd
google=pd.read_csv("google_stock.csv",squeeze=True)
google.head()

0    50.56
1    49.87
2    50.98
3    49.23
4    50.67
Name: 49.52, dtype: float64

In [101]:
google.count()  #no of rows

9

In [102]:
len(google)    # same as count

9

In [103]:
google.sum()

451.294

In [104]:
google.mean()

50.14377777777778

In [105]:
google.max()

50.98

In [106]:
google.sum()/google.count()

50.14377777777778

In [107]:
google.median()

50.233999999999995

In [109]:
import pandas as pd
google=pd.read_csv('google_stock.csv',squeeze=True)
google.head()

0    50.56
1    49.87
2    50.98
3    49.23
4    50.67
Name: 49.52, dtype: float64

In [110]:
google.max()

50.98

In [111]:
google.min()

49.23

In [113]:
google.idxmax()    #index value of 50.98 is 2

2

In [115]:
google[2]

50.98

In [116]:
google.idxmin()

3

In [117]:
google[3]

49.23

In [ ]:
88